import { defineConfig } from 'vitepress'

export default defineConfig({
  base: '/wiki/',
  title: "CosmoLand Wiki", // Название вкладки в браузере
  description: "Официальная вики сервера CosmoLand",
  lang: 'ru-RU', // Указывает браузеру, что сайт на русском
  head: [
  ['link', { rel: 'icon', href: '/wiki/logo1.png' }] // Добавь /wiki/ в начало пути
],
  themeConfig: {
    notFound: {
    title: 'СТРАНИЦА НЕ НАЙДЕНА',
    quote: 'Похоже, вы забрели в неизведанную часть космоса.',
    linkText: 'Вернуться на главную базу',
  },
    // Перевод кнопки поиска
    search: {
      
      provider: 'local',
      options: {
        locales: {
          root: {
            translations: {
              button: { buttonText: 'Поиск', buttonAriaLabel: 'Поиск' },
              modal: { noResultsText: 'Ничего не найдено', resetButtonTitle: 'Сбросить поиск', footer: { selectText: 'выбрать', navigateText: 'навигация', escapeText: 'закрыть' } }
            }
          }
        }
      }
    },

    // Текст кнопки "На этой странице" (справа)
    outline: { label: 'На этой странице', level: [2, 3] },

    // Верхнее меню
    nav: [
      { text: 'Главная', link: '/' },
      { text: 'Гайды', link: '/start' }, // <-- ТУТ НУЖНА ЗАПЯТАЯ
      { text: 'Правила', link: '/rules' }
    ],

    // Боковое меню
    sidebar: [
      {
        text: '🚀 Начни играть',
        items: [
          { text: 'Как зайти?', link: '/start' },
        ]
      },
      {
        text: '🏗️ Механики',
        items: [
          { text: 'Ракеты', link: '/buildings' }
        ]
      },
      {
        text: '🔥Привилегии и возможности',
        items: [
          { text: 'Соликс', link: '/solix' },
          { text: 'Зипфер', link: '/zypher' },
          { text: 'Принц', link: '/prince' }
        ]
      },
      {
        text: '🔥Крафты',
        items: [
          { text: 'Деталь ракеты: "Двигатель"', link: '/dvigatel' },
          { text: 'Деталь ракеты: "Топливная система"', link: '/system' },
          { text: 'Деталь ракеты: "Система управления"', link: '/control' },
          { text: 'Деталь ракеты: "Электросистема"', link: '/electro' }
        ]
      }
    ],

    // Перевод кнопок "Предыдущая" и "Следующая" страница внизу
    docFooter: {
      prev: 'Назад',
      next: 'Вперед'
    },

    socialLinks: [
      { icon: 'discord', link: 'https://discord.gg/твой_код' }
    ],

    footer: {
      message: 'CosmoLand — Космическое выживание',
      copyright: '© 2025-2026 CosmoLand'
    }
  }
})